Revit 2026 API

# ElementMulticategoryFilter(ICollectionBuiltInCategory) Constructor

---

Initializes a new instance of the ElementMulticategoryFilter class

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ElementMulticategoryFilter(
	ICollection<BuiltInCategory> categories
)
```
```vb
Public Sub New (
	categories As ICollection(Of BuiltInCategory)
)
```
```cpp
public:
ElementMulticategoryFilter(
	ICollection<BuiltInCategory>^ categories
)
```
```fsharp
new :
        categories : ICollection<BuiltInCategory> -> ElementMulticategoryFilter
```

#### Parameters

categories ICollectionBuiltInCategory

#### Reference

ElementMulticategoryFilter Class

ElementMulticategoryFilter Overload

Autodesk.Revit.DB Namespace